OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic16/libdev/pic18lf25k80.c
__at(0x0ECF) __sfr CANCON_RO5;
__at(0x0ECF) volatile __CANCON_RO5bits_t CANCON_RO5bits;

__at(0x0ED0) __sfr B5CON;
__at(0x0ED0) volatile __B5CONbits_t B5CONbits;

__at(0x0ED1) __sfr B5SIDH;
__at(0x0ED1) volatile __B5SIDHbits_t B5SIDHbits;

__at(0x0ED2) __sfr B5SIDL;
__at(0x0ED2) volatile __B5SIDLbits_t B5SIDLbits;

__at(0x0ED3) __sfr B5EIDH;
__at(0x0ED3) volatile __B5EIDHbits_t B5EIDHbits;

__at(0x0ED4) __sfr B5EIDL;
__at(0x0ED4) volatile __B5EIDLbits_t B5EIDLbits;

__at(0x0ED5) __sfr B5DLC;
__at(0x0ED5) volatile __B5DLCbits_t B5DLCbits;

__at(0x0ED6) __sfr B5D0;
__at(0x0ED6) volatile __B5D0bits_t B5D0bits;

__at(0x0ED7) __sfr B5D1;
__at(0x0ED7) volatile __B5D1bits_t B5D1bits;

__at(0x0ED8) __sfr B5D2;
__at(0x0ED8) volatile __B5D2bits_t B5D2bits;

__at(0x0ED9) __sfr B5D3;
__at(0x0ED9) volatile __B5D3bits_t B5D3bits;

__at(0x0EDA) __sfr B5D4;
__at(0x0EDA) volatile __B5D4bits_t B5D4bits;

__at(0x0EDB) __sfr B5D5;
__at(0x0EDB) volatile __B5D5bits_t B5D5bits;

__at(0x0EDC) __sfr B5D6;
__at(0x0EDC) volatile __B5D6bits_t B5D6bits;

__at(0x0EDD) __sfr B5D7;
__at(0x0EDD) volatile __B5D7bits_t B5D7bits;

__at(0x0EDE) __sfr CANSTAT_RO4;
__at(0x0EDE) volatile __CANSTAT_RO4bits_t CANSTAT_RO4bits;

__at(0x0EDF) __sfr CANCON_RO4;
__at(0x0EDF) volatile __CANCON_RO4bits_t CANCON_RO4bits;

__at(0x0EE0) __sfr RXF0SIDH;
__at(0x0EE0) volatile __RXF0SIDHbits_t RXF0SIDHbits;

__at(0x0EE1) __sfr RXF0SIDL;
__at(0x0EE1) volatile __RXF0SIDLbits_t RXF0SIDLbits;

__at(0x0EE2) __sfr RXF0EIDH;
__at(0x0EE2) volatile __RXF0EIDHbits_t RXF0EIDHbits;

__at(0x0EE3) __sfr RXF0EIDL;
__at(0x0EE3) volatile __RXF0EIDLbits_t RXF0EIDLbits;

__at(0x0EE4) __sfr RXF1SIDH;
__at(0x0EE4) volatile __RXF1SIDHbits_t RXF1SIDHbits;

__at(0x0EE5) __sfr RXF1SIDL;
__at(0x0EE5) volatile __RXF1SIDLbits_t RXF1SIDLbits;

__at(0x0EE6) __sfr RXF1EIDH;
__at(0x0EE6) volatile __RXF1EIDHbits_t RXF1EIDHbits;

__at(0x0EE7) __sfr RXF1EIDL;
__at(0x0EE7) volatile __RXF1EIDLbits_t RXF1EIDLbits;

__at(0x0EE8) __sfr RXF2SIDH;
__at(0x0EE8) volatile __RXF2SIDHbits_t RXF2SIDHbits;

__at(0x0EE9) __sfr RXF2SIDL;
__at(0x0EE9) volatile __RXF2SIDLbits_t RXF2SIDLbits;

__at(0x0EEA) __sfr RXF2EIDH;
__at(0x0EEA) volatile __RXF2EIDHbits_t RXF2EIDHbits;

__at(0x0EEB) __sfr RXF2EIDL;
__at(0x0EEB) volatile __RXF2EIDLbits_t RXF2EIDLbits;

__at(0x0EEC) __sfr RXF3SIDH;
__at(0x0EEC) volatile __RXF3SIDHbits_t RXF3SIDHbits;

__at(0x0EED) __sfr RXF3SIDL;
__at(0x0EED) volatile __RXF3SIDLbits_t RXF3SIDLbits;

__at(0x0EEE) __sfr RXF3EIDH;
__at(0x0EEE) volatile __RXF3EIDHbits_t RXF3EIDHbits;

__at(0x0EEF) __sfr RXF3EIDL;
__at(0x0EEF) volatile __RXF3EIDLbits_t RXF3EIDLbits;

__at(0x0EF0) __sfr RXF4SIDH;
__at(0x0EF0) volatile __RXF4SIDHbits_t RXF4SIDHbits;

__at(0x0EF1) __sfr RXF4SIDL;
__at(0x0EF1) volatile __RXF4SIDLbits_t RXF4SIDLbits;

__at(0x0EF2) __sfr RXF4EIDH;
__at(0x0EF2) volatile __RXF4EIDHbits_t RXF4EIDHbits;

__at(0x0EF3) __sfr RXF4EIDL;
__at(0x0EF3) volatile __RXF4EIDLbits_t RXF4EIDLbits;

__at(0x0EF4) __sfr RXF5SIDH;
__at(0x0EF4) volatile __RXF5SIDHbits_t RXF5SIDHbits;

__at(0x0EF5) __sfr RXF5SIDL;
__at(0x0EF5) volatile __RXF5SIDLbits_t RXF5SIDLbits;

__at(0x0EF6) __sfr RXF5EIDH;
__at(0x0EF6) volatile __RXF5EIDHbits_t RXF5EIDHbits;

__at(0x0EF7) __sfr RXF5EIDL;
__at(0x0EF7) volatile __RXF5EIDLbits_t RXF5EIDLbits;

__at(0x0EF8) __sfr RXM0SIDH;
__at(0x0EF8) volatile __RXM0SIDHbits_t RXM0SIDHbits;

__at(0x0EF9) __sfr RXM0SIDL;
__at(0x0EF9) volatile __RXM0SIDLbits_t RXM0SIDLbits;

__at(0x0EFA) __sfr RXM0EIDH;
__at(0x0EFA) volatile __RXM0EIDHbits_t RXM0EIDHbits;

__at(0x0EFB) __sfr RXM0EIDL;
__at(0x0EFB) volatile __RXM0EIDLbits_t RXM0EIDLbits;

__at(0x0EFC) __sfr RXM1SIDH;
__at(0x0EFC) volatile __RXM1SIDHbits_t RXM1SIDHbits;

__at(0x0EFD) __sfr RXM1SIDL;
__at(0x0EFD) volatile __RXM1SIDLbits_t RXM1SIDLbits;

__at(0x0EFE) __sfr RXM1EIDH;
__at(0x0EFE) volatile __RXM1EIDHbits_t RXM1EIDHbits;

__at(0x0EFF) __sfr RXM1EIDL;
__at(0x0EFF) volatile __RXM1EIDLbits_t RXM1EIDLbits;

__at(0x0F00) __sfr TXB2CON;
__at(0x0F00) volatile __TXB2CONbits_t TXB2CONbits;

__at(0x0F01) __sfr TXB2SIDH;
__at(0x0F01) volatile __TXB2SIDHbits_t TXB2SIDHbits;

__at(0x0F02) __sfr TXB2SIDL;
__at(0x0F02) volatile __TXB2SIDLbits_t TXB2SIDLbits;

__at(0x0F03) __sfr TXB2EIDH;
__at(0x0F03) volatile __TXB2EIDHbits_t TXB2EIDHbits;

__at(0x0F04) __sfr TXB2EIDL;
__at(0x0F04) volatile __TXB2EIDLbits_t TXB2EIDLbits;

__at(0x0F05) __sfr TXB2DLC;
__at(0x0F05) volatile __TXB2DLCbits_t TXB2DLCbits;

__at(0x0F06) __sfr TXB2D0;
__at(0x0F06) volatile __TXB2D0bits_t TXB2D0bits;

__at(0x0F07) __sfr TXB2D1;
__at(0x0F07) volatile __TXB2D1bits_t TXB2D1bits;

__at(0x0F08) __sfr TXB2D2;
__at(0x0F08) volatile __TXB2D2bits_t TXB2D2bits;

__at(0x0F09) __sfr TXB2D3;
__at(0x0F09) volatile __TXB2D3bits_t TXB2D3bits;

__at(0x0F0A) __sfr TXB2D4;
__at(0x0F0A) volatile __TXB2D4bits_t TXB2D4bits;

__at(0x0F0B) __sfr TXB2D5;
__at(0x0F0B) volatile __TXB2D5bits_t TXB2D5bits;

__at(0x0F0C) __sfr TXB2D6;
__at(0x0F0C) volatile __TXB2D6bits_t TXB2D6bits;

__at(0x0F0D) __sfr TXB2D7;
__at(0x0F0D) volatile __TXB2D7bits_t TXB2D7bits;

__at(0x0F0E) __sfr CANSTAT_RO3;
__at(0x0F0E) volatile __CANSTAT_RO3bits_t CANSTAT_RO3bits;

__at(0x0F0F) __sfr CANCON_RO3;
__at(0x0F0F) volatile __CANCON_RO3bits_t CANCON_RO3bits;

__at(0x0F10) __sfr TXB1CON;
__at(0x0F10) volatile __TXB1CONbits_t TXB1CONbits;

__at(0x0F11) __sfr TXB1SIDH;
__at(0x0F11) volatile __TXB1SIDHbits_t TXB1SIDHbits;

__at(0x0F12) __sfr TXB1SIDL;
__at(0x0F12) volatile __TXB1SIDLbits_t TXB1SIDLbits;

__at(0x0F13) __sfr TXB1EIDH;
__at(0x0F13) volatile __TXB1EIDHbits_t TXB1EIDHbits;

__at(0x0F14) __sfr TXB1EIDL;
__at(0x0F14) volatile __TXB1EIDLbits_t TXB1EIDLbits;

__at(0x0F15) __sfr TXB1DLC;
__at(0x0F15) volatile __TXB1DLCbits_t TXB1DLCbits;

__at(0x0F16) __sfr TXB1D0;
__at(0x0F16) volatile __TXB1D0bits_t TXB1D0bits;

__at(0x0F17) __sfr TXB1D1;
__at(0x0F17) volatile __TXB1D1bits_t TXB1D1bits;

__at(0x0F18) __sfr TXB1D2;
__at(0x0F18) volatile __TXB1D2bits_t TXB1D2bits;

__at(0x0F19) __sfr TXB1D3;
__at(0x0F19) volatile __TXB1D3bits_t TXB1D3bits;

__at(0x0F1A) __sfr TXB1D4;
__at(0x0F1A) volatile __TXB1D4bits_t TXB1D4bits;

__at(0x0F1B) __sfr TXB1D5;
__at(0x0F1B) volatile __TXB1D5bits_t TXB1D5bits;

